Revit 2027 API
PerformanceAdviser.WillRuleCheckElements(Int32) Method
 Reports if rule needs to be executed on individual elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WillRuleCheckElements(
	int index
)
Public Function WillRuleCheckElements (
	index As Integer
) As Boolean
public:
bool WillRuleCheckElements(
	int index
)
member WillRuleCheckElements :
        index : int -> bool
Parameters
index Int32
 The rule index to get information for.
Return Value
Boolean
 True if rule needs to be executed on individual elements.
See Also
Reference
PerformanceAdviser Class
WillRuleCheckElements Overload
Autodesk.Revit.DB Namespace